Revit 2027 API
Dimension.Value Property
 The value of the dimension.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double? Value { get; }
Public ReadOnly Property Value As Double?
	Get
public:
property Nullable<double> Value {
	Nullable<double> get ();
}
member Value : Nullable<float> with get
Property Value
Nullable<Double>
Remarks
 This nullable property will not have a value for spot dimensions or for linear dimensions with more than one segment.
See Also
Reference
Dimension Class
Autodesk.Revit.DB Namespace